# Capstone Project Phase 1:

# Assignment 1: Build the team & other logistics [3 Points]

1. Find members, make team.
2. Select team lead and create one github repository per team for project.
3. Create Readme.MD file and put name of your teammates. Submit the repository link.

# Assignment 2: Pick Problem Statement & Dataset [5 Points]

1. Define your problem statement. (tentative, can be changed in future)
2. Find the dataset for your project.
3. Add details of problem statement & dataset link to your github readme file.

# Python Pandas Assignment:

In [23]:
# Problem: Create dataframe with custom row index & column name. The dimension should be 10x4. 
#    Custom Index should start from 101 to 110. column name should be `a` to `d`. 
#    `a` should be strings, `b` should be numbers, `c` & 'd' should be float.
#     fill up random values using numpy.random.  [4 Points]
import pandas as pd
import numpy as np

df= pd.DataFrame({'a': np.random.choice(['One', 'Two', 'Three'], 10),
                 'b':np.random.randint(1,2,10),
                 'c':np.random.uniform(1.0,2.0,10),
                 'd':np.random.uniform(1.0,2.0,10)},index=range(101,111))
    # TODO: Implement rest 3 columns 
df

         a  b         c         d
101    One  1  1.196627  1.589080
102  Three  1  1.679766  1.826866
103  Three  1  1.749908  1.211056
104    Two  1  1.141017  1.171182
105  Three  1  1.783137  1.892348
106  Three  1  1.931085  1.397097
107    Two  1  1.341460  1.115891
108    One  1  1.083139  1.474855
109    Two  1  1.989144  1.736795
110  Three  1  1.749549  1.753576

In [24]:
# Problem: Use the original dataframe to create another dataframe that has rows from index 103 to 108. [1 Points]
df=df.loc[103:108]
df

         a  b         c         d
103  Three  1  1.749908  1.211056
104    Two  1  1.141017  1.171182
105  Three  1  1.783137  1.892348
106  Three  1  1.931085  1.397097
107    Two  1  1.341460  1.115891
108    One  1  1.083139  1.474855

In [25]:
# Problem: Use the original dataframe to create another dataframe that does not have first and last row [1 Points]

df0=df.tail(5)
df1=df0.head(4)
df1

         a  b         c         d
104    Two  1  1.141017  1.171182
105  Three  1  1.783137  1.892348
106  Three  1  1.931085  1.397097
107    Two  1  1.341460  1.115891

In [29]:
# Problem: Group and print orignal dataframe by column `a`
df.loc[:, 'a']

103    Three
104      Two
105    Three
106    Three
107      Two
108      One
Name: a, dtype: object

In [27]:
# Problem: Use the orginal dataframe and drop first and last column [1 Points]
Drop=df.drop(103)
Drop.drop(108)

         a  b         c         d
104    Two  1  1.141017  1.171182
105  Three  1  1.783137  1.892348
106  Three  1  1.931085  1.397097
107    Two  1  1.341460  1.115891